mermaid diagram in readme
